ezois_ka/oooezoiskaobmen.ИТБК_/src/Reports/СтруктураУзлов/СтруктураУзлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СтруктураУзлов</name>
  <attributes>
    <name>ВариантКомплектации</name>
    <type>
      <types>CatalogRef.ВариантыКомплектацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантФормирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзКомплектации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

ezois_ka/oooezoiskaobmen.ИТБК_/src/Reports/СтруктураУзлов/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    ВариантКомплектации = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.Элементы.Найти("ВариантКомплектации").Значение;
    ВариантФормирования = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.Элементы.Найти("ВариантФормирования").Значение;
    СтандартнаяОбработка = Ложь;
    ДЗ = новый ДеревоЗначений;
    Дз.Колонки.Добавить("Номенклатура", новый ОписаниеТипов("СправочникСсылка.Номенклатура"),"Номенклатура");
    Дз.Колонки.Добавить("Характеристика", новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),"Характеристика");
    Дз.Колонки.Добавить("ИД_",новый ОписаниеТипов("строка"),"ИД");
    Дз.Колонки.Добавить("РодительИД", новый ОписаниеТипов("Число"),"РодительИД");
    Дз.Колонки.Добавить("ИД",новый ОписаниеТипов("Число"),"ИД");
    Дз.Колонки.Добавить("Комплектация",новый ОписаниеТипов("СправочникСсылка.ВариантыКомплектацииНоменклатуры"),"Комплектация");
    Дз.Колонки.Добавить("Количество",новый ОписаниеТипов("Число"),"Количество");
    Дз.Колонки.Добавить("Количество2",новый ОписаниеТипов("Число"),"Количество");
    Дз.Колонки.Добавить("Всего",новый ОписаниеТипов("Число"),"Количество");
    Дз.Колонки.Добавить("КоличествоМатериалов",новый ОписаниеТипов("Число"),"Количество");
    Дз.Колонки.Добавить("Цена",новый ОписаниеТипов("Число"),"Количество");
    Дз.Колонки.Добавить("Сумма",новый ОписаниеТипов("Число"),"Количество");
    Материалы.Очистить();
    ЗаполнитьДерево(ДЗ);
    Материалы.Свернуть("Номенклатура","Количество");
    
    Если ВариантФормирования = "Иерархия"  Тогда   
        ЗаполнитьВсего(ДЗ);
    КонецЕсли;
    
    СформироватьТабличныйДокументНаСервере(ДЗ,ДокументРезультат,ДанныеРасшифровки);
    
КонецПроцедуры

Процедура ЗаполнитьВсего(Род)
    
    для Каждого стр из Род.Строки цикл
        ЗаполнитьВсего(стр);
        стр.Всего = Материалы.Найти(стр.номенклатура).Количество; 
    КонецЦикла;
    
КонецПроцедуры	

Процедура ЗаполнитьДерево(ДЗ)
    
    ЗаполнитьДеревоСервер(ДЗ);
    
КонецПроцедуры	

Процедура ЗаполнитьДеревоСервер(ДЗ)
    
    ДЗ.Строки.Очистить();
    
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура1,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК НоменклатураОсн,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ вт2
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|ГДЕ
	|	(ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной
	|				И НЕ ВариантыКомплектацииНоменклатурыТовары.Ссылка.ПометкаУдаления
	|				И ВариантыКомплектацииНоменклатурыТовары.Количество <> 0
	|				И НЕ ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец = &Владелец
	|			ИЛИ ВариантыКомплектацииНоменклатурыТовары.Ссылка = &ВариантКомплектации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт2.Номенклатура КАК Номенклатура,
	|	вт2.Количество КАК Количество,
	|	вт2.НоменклатураОсн КАК НоменклатураОсн,
	|	вт2.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(вт1.Цена, 0) КАК Цена
	|ИЗ
	|	вт2 КАК вт2
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт1 КАК вт1
	|		ПО (вт1.Номенклатура1 = вт2.Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт2.Номенклатура.Наименование";
	// begin fix Designer 25.11.2023 3:35:17
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура1,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика1,
	|	ЦеныНоменклатурыСрезПоследних.Цена * ВЫБОР
	|		КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель, 0) = 0
	|			ТОГДА 0                                             
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Знаменатель, 1) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель, 1) КАК ЧИСЛО(17, 7))
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура1,
	|	Характеристика1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК НоменклатураОсн,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика КАК ХарактеристикаОсн
	|ПОМЕСТИТЬ вт2
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|ГДЕ
	|	(ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной
	|				И НЕ ВариантыКомплектацииНоменклатурыТовары.Ссылка.ПометкаУдаления
	|				И ВариантыКомплектацииНоменклатурыТовары.Количество <> 0
	|				И НЕ ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец = &Владелец
	|			ИЛИ ВариантыКомплектацииНоменклатурыТовары.Ссылка = &ВариантКомплектации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт2.Номенклатура КАК Номенклатура,
	|	вт2.Характеристика КАК Характеристика,
	|	вт2.Количество КАК Количество,
	|	вт2.НоменклатураОсн КАК НоменклатураОсн,
	|	вт2.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(вт1.Цена, 0) КАК Цена,
	|	вт2.ХарактеристикаОсн КАК ХарактеристикаОсн
	|ИЗ
	|	вт2 КАК вт2
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт1 КАК вт1
	|		ПО (вт1.Номенклатура1 = вт2.Номенклатура)
	|			И (вт1.Характеристика1 = вт2.Характеристика)
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт2.Номенклатура.Наименование,
	|   вт2.Характеристика.Наименование
	|";
    // end fix Designer 25.11.2023 3:35:25
		
    Запрос.УстановитьПараметр("ВидЦены", 	КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.Элементы.Найти("ВидЦены").Значение);
    Запрос.УстановитьПараметр("Изделие", 	ВариантКомплектации.Владелец);
    Запрос.УстановитьПараметр("Владелец", 	ВариантКомплектации.Владелец);
    Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
    Комплектации = Запрос.Выполнить().Выгрузить();
    
    НомерСтроки = 1;
    нСтр1 = ДЗ;
    Если   ВариантФормирования = "Иерархия"   тогда
        нСтр1 = ДЗ.Строки.Добавить();
        нСтр1.Номенклатура 		= ВариантКомплектации.Владелец;  
		нСтр1.Характеристика 	= ВариантКомплектации.Характеристика;
        нСтр1.Ид_ = "" ;
        нСтр1.Ид = НомерСтроки ;
        нСтр1.Количество = 1 ;
        стр2 = Материалы.Добавить();
        стр2.Номенклатура 	=  нСтр1.Номенклатура; 
		стр2.Характеристика =  нСтр1.Характеристика;
        стр2.Количество =  нСтр1.Количество;
    КонецЕсли;
    ДобавитьСтрокиДерева(Комплектации, ДЗ, ВариантКомплектации.Владелец, ВариантКомплектации.Характеристика, нСтр1,,,НомерСтроки,1);
    Если   ВариантФормирования = "Иерархия"   тогда
        для Каждого стр1 из  нСтр1.Строки цикл
            нСтр1.КоличествоМатериалов = нСтр1.КоличествоМатериалов + стр1.КоличествоМатериалов;
            нСтр1.Сумма =  нСтр1.Сумма + стр1.Сумма; ;
        КонецЦикла;
     нСтр1.Количество = 0 ;
 КонецЕсли;
      
КонецПроцедуры

Процедура ДобавитьСтрокиДерева(Комплектации, ДЗ, НоменклатураСборки, ХарактеристикаСборки, Родитель, Комплектация = Неопределено, ИД = "",НомерСтроки=0, КоличествоРодителя = 1)
    
    
    //если это не автосборка Если НоменклатураСборки.... тогда Возврат КонецЕсли;
    Если Комплектация = Неопределено тогда
        Комплектация = Комплектации.НайтиСтроки(новый Структура("НоменклатураОсн, ХарактеристикаОсн",НоменклатураСборки, ХарактеристикаСборки));
    КонецЕсли;
    Порядок = 0;
    Для Каждого стр из Комплектация цикл
        
        мКомплектация = Комплектации.найтистроки(новый Структура("НоменклатураОсн, ХарактеристикаОсн",стр.Номенклатура,стр.Характеристика));
        Если ВариантФормирования = "Иерархия"  или  
            ВариантФормирования <> "Иерархия"  и  мКомплектация.количество() = 0 тогда
            Порядок = Порядок + 1;
            нСтр1 = Родитель.Строки.Добавить();
            Если ВариантФормирования = "Иерархия" тогда 
                Родитель.Комплектация = стр.Ссылка; 
            иначе
                нСтр1.Комплектация = стр.Ссылка; 
            КонецЕсли;
            нСтр1.Номенклатура = стр.Номенклатура; 
			нСтр1.Характеристика = стр.Характеристика;
            нСтр1.Количество = стр.Количество * КоличествоРодителя / стр.ссылка.Количество ;
            нСтр1.Количество2 = стр.Количество  ;
            нСтр1.Цена = стр.Цена ;
            нСтр1.Ид_ = ?(ВариантФормирования = "Иерархия", ИД + ?(ИД <> "", ".","") + формат(Порядок,"ЧГ = 0"),НомерСтроки);
            нСтр1.РодительИД = ?(ВариантФормирования = "Иерархия",Родитель.ИД,0);
            НомерСтроки = НомерСтроки + 1;
            нСтр1.ИД = НомерСтроки;
            
            нСтр1.КоличествоМатериалов =  0;
            нСтр1.Сумма =  0;           
            Если мКомплектация.количество() тогда 
                //если есть комплектация, то добавим в дерево и заполним материалы для нее в рекурсии
                ДобавитьСтрокиДерева(Комплектации, ДЗ, стр.Номенклатура, стр.Характеристика, нСтр1, мКомплектация, нСтр1.Ид_ ,НомерСтроки,нСтр1.Количество);
                для Каждого стр1 из  нСтр1.Строки цикл
                    нСтр1.КоличествоМатериалов = нСтр1.КоличествоМатериалов + стр1.КоличествоМатериалов;
                    нСтр1.Сумма =  нСтр1.Сумма + стр1.Сумма; ;
                КонецЦикла;
            Иначе 
                нСтр1.КоличествоМатериалов =  нСтр1.Количество  ;
                нСтр1.Сумма =  нСтр1.Количество * нСтр1.Цена;
            КонецЕсли;
            стр2 = Материалы.Добавить();
            стр2.Номенклатура 	=  нСтр1.Номенклатура;
			стр2.Характеристика =  нСтр1.Характеристика;
            стр2.Количество 	=  нСтр1.Количество;

		Иначе
			
            ДобавитьСтрокиДерева(Комплектации, ДЗ, стр.Номенклатура, стр.Характеристика, Родитель, мКомплектация,"" ,НомерСтроки,стр.Количество * КоличествоРодителя / стр.ссылка.Количество);
            
        КонецЕсли;
        
        
    КонецЦикла;
    
    
КонецПроцедуры

Процедура СформироватьТабличныйДокументНаСервере(ДанныеДерева,ТабДокумент,ДанныеРасшифровки)
    
    //ТабДокумент = Новый ТабличныйДокумент;
    
    
    ИсточникиДанных = Новый Структура("ДанныеДерева", ДанныеДерева);
    СхемаКомпоновки = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровки);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;	
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ИсточникиДанных,ДанныеРасшифровки);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ТабДокумент);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
    
КонецПроцедуры

Функция СведенияОВнешнейОбработке() Экспорт
    
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.1.1.10");
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
    ПараметрыРегистрации.Версия = "1.0";
    ПараметрыРегистрации.БезопасныйРежим = Ложь;
    НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
    НоваяКоманда.Представление = НСтр("ru = 'Структура узлов'");
    НоваяКоманда.Идентификатор = "СтруктураУзлов";
    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    НоваяКоманда.ПоказыватьОповещение = Истина;
    
    Возврат ПараметрыРегистрации;
    
КонецФункции
